In [1]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame({
    "Column1":[1,2,3,4,5,6],
    "Column2":[100,100,200,300,300,100],
    "Column3":["Mustafa","Kamil","Emre","Ayşe","Murat","Zeynep"]
})

In [3]:
df

   Column1  Column2  Column3
0        1      100  Mustafa
1        2      100    Kamil
2        3      200     Emre
3        4      300     Ayşe
4        5      300    Murat
5        6      100   Zeynep

In [4]:
df.head()

   Column1  Column2  Column3
0        1      100  Mustafa
1        2      100    Kamil
2        3      200     Emre
3        4      300     Ayşe
4        5      300    Murat

In [5]:
df.head(3)

   Column1  Column2  Column3
0        1      100  Mustafa
1        2      100    Kamil
2        3      200     Emre

In [6]:
df.head(n=3)

   Column1  Column2  Column3
0        1      100  Mustafa
1        2      100    Kamil
2        3      200     Emre

In [9]:
df["Column2"].unique()#unique değerleri bulduk

array([100, 200, 300], dtype=int64)

In [11]:
df["Column2"].nunique()#unique değerlerin sayısı

3

In [13]:
len(df["Column2"].unique())#len burda çalıştı

3

In [14]:
df["Column2"].value_counts()

100    3
300    2
200    1
Name: Column2, dtype: int64

In [16]:
df["Column2"].value_counts(100)#yüzdelik oranını verdi

100    0.500000
300    0.333333
200    0.166667
Name: Column2, dtype: float64

In [17]:
df

   Column1  Column2  Column3
0        1      100  Mustafa
1        2      100    Kamil
2        3      200     Emre
3        4      300     Ayşe
4        5      300    Murat
5        6      100   Zeynep

In [20]:
df[(df["Column1"]>=4) & (df["Column2"]==300)]

   Column1  Column2 Column3
3        4      300    Ayşe
4        5      300   Murat

In [21]:
df

   Column1  Column2  Column3
0        1      100  Mustafa
1        2      100    Kamil
2        3      200     Emre
3        4      300     Ayşe
4        5      300    Murat
5        6      100   Zeynep

In [23]:
df["Column2"]*3

0    300
1    300
2    600
3    900
4    900
5    300
Name: Column2, dtype: int64

In [24]:
#or...

In [26]:
def times3(x):
    return x*3

In [28]:
times3(6)

18

In [30]:
df["Column2"].apply(times3)#herhangi bir sütuna bir fonksiyon uygulanabilir böyle

0    300
1    300
2    600
3    900
4    900
5    300
Name: Column2, dtype: int64

In [35]:
df.xs(0, axis =0)

Column1          1
Column2        100
Column3    Mustafa
Name: 0, dtype: object

In [36]:
df.xs(0, axis =0).xs("Column3")

'Mustafa'

In [40]:
df["Column2"] = df["Column2"].apply(times3)

In [41]:
df

   Column1  Column2  Column3
0        1      300  Mustafa
1        2      300    Kamil
2        3      600     Emre
3        4      900     Ayşe
4        5      900    Murat
5        6      300   Zeynep

In [43]:
tv = lambda x : x*2

In [44]:
tv(6)

12

In [45]:
df["Column2"].apply(lambda x : x*3)

0     900
1     900
2    1800
3    2700
4    2700
5     900
Name: Column2, dtype: int64

In [46]:
df["Column3"].apply(len)

0    7
1    5
2    4
3    4
4    5
5    6
Name: Column3, dtype: int64

In [47]:
df

   Column1  Column2  Column3
0        1      300  Mustafa
1        2      300    Kamil
2        3      600     Emre
3        4      900     Ayşe
4        5      900    Murat
5        6      300   Zeynep

In [49]:
df.drop("Column3", axis = 1)

   Column1  Column2
0        1      300
1        2      300
2        3      600
3        4      900
4        5      900
5        6      300

In [50]:
df

   Column1  Column2  Column3
0        1      300  Mustafa
1        2      300    Kamil
2        3      600     Emre
3        4      900     Ayşe
4        5      900    Murat
5        6      300   Zeynep

In [51]:
df.drop("Column3", axis=1, inplace=True)

In [52]:
df

   Column1  Column2
0        1      300
1        2      300
2        3      600
3        4      900
4        5      900
5        6      300

In [53]:
df.columns

Index(['Column1', 'Column2'], dtype='object')

In [56]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [61]:
len(df.index)#satır sayısı(index sayısı)

6

In [62]:
df.size#hücre sayısı

12

In [63]:
df.sort_values("Column2")

   Column1  Column2
0        1      300
1        2      300
5        6      300
2        3      600
3        4      900
4        5      900

In [64]:
df.sort_values("Column2", ascending=False)

   Column1  Column2
3        4      900
4        5      900
2        3      600
0        1      300
1        2      300
5        6      300

In [65]:
df = pd.DataFrame({
    "Ay" : ["Mart","Nisan","Mayıs","Mart","Nisan","Mayıs","Mart","Nisan","Mayıs"],
    "Şehir":["Ankara","Ankara","Ankara","İstanbul","İstanbul","İstanbul","İzmir","İzmir","İzmir"],
    "Nem":[10,25,50,21,67,80,30,70,75]
})

In [66]:
df

      Ay     Şehir  Nem
0   Mart    Ankara   10
1  Nisan    Ankara   25
2  Mayıs    Ankara   50
3   Mart  İstanbul   21
4  Nisan  İstanbul   67
5  Mayıs  İstanbul   80
6   Mart     İzmir   30
7  Nisan     İzmir   70
8  Mayıs     İzmir   75

In [69]:
df.count(axis=1)

0    3
1    3
2    3
3    3
4    3
5    3
6    3
7    3
8    3
dtype: int64

In [73]:
Ay=["Mart","Nisan","Mayıs","Mart","Nisan","Mayıs","Mart","Nisan","Mayıs"]

In [89]:
b =[]
Şehir=["Ankara","Ankara","Ankara","İstanbul","İstanbul","İstanbul","İzmir","İzmir","İzmir"]
Nem=[10,25,50,21,67,80,30,70,75]
b = [i for i in Ay if b.count(i)==0]

In [91]:
#pivottable oluşturma

In [97]:
df.pivot_table(index="Ay",columns="Şehir",values="Nem")

Şehir  Ankara  İstanbul  İzmir
Ay
Mart       10        21     30
Mayıs      50        80     75
Nisan      25        67     70

In [98]:
df.pivot_table(index="Şehir",columns="Ay",values="Nem")

Ay        Mart  Mayıs  Nisan
Şehir
Ankara      10     50     25
İstanbul    21     80     67
İzmir       30     75     70

In [2]:
df = pd.DataFrame({
    "Element":["Al","C","Cr","Cu","Fe","Mn","Mo","N","Na","Ni","O","P","S","Si"]
    "Tedarikci": ["BOA","Witzenmann"]
    "kV": [10,20]
    "Part No": ["Part-1","Part-2","Part3","Part-4","Part-5"]
    "Ortalama Sonuclar": [W_p1_ort_10, W_p1_ort_20, W_p2_ort_10, W_p2_ort_20]
})

SyntaxError: invalid syntax. Perhaps you forgot a comma? (1446928534.py, line 2)